app/controllers/authentications_controller.rb

SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`uid` = '96084671' AND `authentications`.`provider` = 'twitter' AND (`authentications`.user_id = 1) LIMIT 1
INSERT INTO `authentications` (`created_at`, `updated_at`, `uid`, `user_id`, `provider`) VALUES ('2011-06-25 11:53:03', '2011-06-25 11:53:03', '96084671', 1, 'twitter')
---
  def create
    auth =request.env["omniauth.auth"]
    authentication = Authentication.find_by_provider_and_uid(auth['provider'], auth['uid'])
    if authentication
      sign_in_and_redirect(:user, authentication.user)
    elsif current_user
      current_user.authentications.create!(:provider => auth['provider'], :uid => auth['uid'])